feat: include additional exercises
